test_examples/tube_OpenFoam3d_abaqus3d/Test_Writing_pointDisplacementFromSourceCode_Explicit/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

R 0.005; 	// Radius of tube
L 0.05; 	// Length of tube 

Ntop 48; 	// Number of intervals along axis 
N1 8;		// Number of intervals on the edges of the central block
N2 2;		// Number of intervals on the diagonals connecting the central block to the outer cylinder

nR #calc "-$R";
nL #calc "-$L";
halfR #calc "$R/2";
halfL #calc "$L/2";
nhalfR #calc "-$halfR";
nhalfL #calc "-$halfL";


vertices
(
    ($nhalfL $nhalfR 0)		//0
    ($halfL $nhalfR 0)         	//1
    ($halfL 0 $halfR)         	//2
    ($nhalfL 0 $halfR)         	//3

    ($nhalfL $halfR 0)         	//4
    ($nhalfL 0 $nhalfR)         //5
    ($halfL 0 $nhalfR)        	//6
    ($halfL $halfR 0)         	//7

    ($nhalfL $nR 0)      	//8
    ($halfL $nR 0)      	//9
    ($nhalfL 0 $R)      	//10
    ($halfL 0 $R)      		//11
	
    ($nhalfL $R 0)		//12
    ($halfL $R 0)		//13
    
    ($nhalfL 0 $nR)		//14
    ($halfL 0 $nR) 		//15

);

blocks
(
    hex (1 0 3 2 6 5 4 7) ($Ntop $N1 $N1) simpleGrading (1 1 1)
    hex (0 1 2 3 8 9 11 10) ($Ntop $N1 $N2) simpleGrading (1 1 1)
    hex (3 2 7 4 10 11 13 12) ($Ntop $N1 $N2) simpleGrading (1 1 1)
    hex (4 7 6 5 12 13 15 14) ($Ntop $N1 $N2) simpleGrading (1 1 1)
    hex (5 6 1 0 14 15 9 8) ($Ntop $N1 $N2) simpleGrading (1 1 1)
);

edges
(
    arc 8 10 ($nhalfL $R 0)
    arc 10 12 ($nhalfL 0 $nR)
    arc 12 14 ($nhalfL $nR 0)
    arc 14 8 ($nhalfL 0 $R)
    arc 9 11 ($halfL $R 0)
    arc 11 13 ($halfL 0 $nR)
    arc 13 15 ($halfL $nR 0)
    arc 15 9 ($halfL 0 $R)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
		(0 3 4 5)
		(0 8 10 3) 
		(3 10 12 4) 
		(5 4 12 14) 
		(5 14 8 0) 
        );
    }
    outlet
    {
        type patch;
        faces
        (
		(1 6 7 2)
		(1 2 11 9)
		(2 7 13 11) 
		(7 6 15 13) 
		(1 9 15 6) 
        );
    }
    
    mantle
    {
        type wall;
        faces
        (
	    (8 9 11 10)
	    (11 13 12 10)
	    (12 13 15 14)
	    (14 15 9 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
