test_examples/tube_OpenFoam3d_abaqus3d/Test_Writing_pointDisplacementFromSourceCode_Explicit/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
-0.0021875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.0021875
-0.001875
-0.0015625
-0.00125
-0.0009375
-0.000625
-0.0003125
5.5145374e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
-0.0021875
-0.001875
-0.0015625
-0.00125
-0.0009375
-0.000625
-0.0003125
5.5145374e-21
...
)
;
    }
    mantle
    {
        type            calculated;
        value           nonuniform List<scalar> 
1536
(
-0.0049519632
-0.004761662
-0.0043883729
-0.003846441
-0.0031566925
-0.0023456342
-0.0014444344
-0.00048772581
...
)
;
    }
}


// ************************************************************************* //
